#include <iostream>
#include <math.h>
using namespace std;

int main() {
	//операції з адресами
	// адреса + число = адреса. виконується відповідно до розміру типу
	// адреса - число = адреса.
	// адреса - адреса = число. показує зміщення між адресами

	//адреса + адреса - не існує

	

	int mas[5] = { 5, 8, 3, 66, 7 };

	//адреси йдуть по наростаючій

	int* p1 = &mas[2]; //3

	cout << *p1 << endl;
	cout << p1[0] << endl;
	cout << p1[1] << endl;
	cout << p1[2] << endl;
	cout << p1[-1] << endl;
	cout << p1[-2] << endl;

	

	return 0;
};