#include <iostream>
#include <math.h>
using namespace std;

int main() {
	//операції з адресами
	// адреса + число = адреса. виконується відповідно до розміру типу
	// адреса - число = адреса.
	// адреса - адреса = число. показує зміщення між адресами

	//адреса + адреса - не існує

	

	int mas[5] = { 5, 8, 3, 66, 7 };

	//адреси йдуть по наростаючій

	int* p1 = &mas[1]; //8
	int* p2 = &mas[3]; //66

	cout << p2 - mas << endl; //якщо ми від якогось покажчика всередині масива віднімемо початок mas - ми отримаємо його індекс
	cout << p2 - p1 << endl; //тут ми дізнаємось скільки між ними зміщення

	//ми віднімаємо від p2 mas, а потіи ділимо на size of int (тобто 4)
	//В ЦЬОМУ ВИПАДКУ

	return 0;
};