#include <iostream>
#include <math.h>
using namespace std;

int main() {
	//2 - показчик на константу
	//зберігаємо адресу не константного або константного об'єкту
	//можемо тільки читати об'єкт
	//const тип* назва; or type const* name; 

	int a = 9;
	int b = 19;
	int const n = 10;
	const int* p2;
	p2 = &a;
	cout << *p2 << endl;
	p2 = &b;
	cout << *p2 << endl;
	//*p2 = 77; заборонено міняти об'єкт за показчиком на константу
	p2 = &n;
	cout << *p2 << endl;


	//3 - константний показчик
	//зберігаємо адресу не константного об'єкту
	//можемо читати і змінювати
	//в момент створення вказуємо адресу об'єкту і не можемо її змінювати
	// тип * конст назва = ініціалізація;

	//int a = 9;
	//int b = 19;
	//int const n = 10;
	//int* const p3 = &a;
	//p3 = &a; - заборонено міняти адресу константного показчика
   // cout << *p3 << endl;
	//*p3 = 123; //а його значення міняти можна

	//масив - константний показчик
	int mas[5];
	mas[1] = 123;
	*mas = 222;
	*(mas + 2) = 333;
	int* const p32 = mas;
	*(p32 + 3) = 333;

 
	//константний показчик на константу
	//const type * const name = initialization
	//*p2 = 77; заборонено міняти об'єкт за показчиком на константу
	//p3 = &a; - заборонено міняти адресу константного показчика

	int x = 9;
	int y = 19;
	int const m = 10;
	const int* const p4 = &x;
	const int* const p41 = &y;
	cout << *p4 << endl;



	return 0;
};