#include <iostream>
#include <math.h>
using namespace std;

int main() {
	//операції з адресами
	// адреса + число = адреса. виконується відповідно до розміру типу
	// адреса - число = адреса.
	// адреса - адреса = число. показує зміщення між адресами

	//адреса + адреса - не існує

	

	int mas[5] = { 5, 8, 3, 66, 7 };

	for (int i = 0; i < 5; i++) {
		cout << mas + i << "\t" << &mas[i] << "\t" << mas[i] << endl;
	}

	cout << endl;

	for (int i = 0; i < 5; i++) {
		cout << *(mas + i) << "\t" << mas[i] << endl;
		//тотожність для масивів
	}

	//в int крок +1 завжди 4

	return 0;
};